{"backend": "tensorflow", "keras_version": "2.1.4", "config": [{"config": {"use_bias": true, "dtype": "float32", "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_1", "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "activation": "relu", "data_format": "channels_last", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 32, "name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"use_bias": true, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}