{"keras_version": "2.1.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_1", "kernel_constraint": null, "batch_input_shape": [null, 64, 64, 3], "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "activation": "relu", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_constraint": null, "units": 128, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_2", "kernel_constraint": null, "units": 1, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow"}